Конфигурация отчетов/Documents/СписокОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СписокОборудования</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ТекущееСостояниеОборудования</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Заведение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Список</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Оборудование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Местоположение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Заведение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/Documents/СписокОборудования/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура СписокПриИзмененииНаСервере()
	Для Каждого Оборудование Из Объект.Список Цикл
		
		Если Строка(Оборудование.Состояние) = "" Тогда
			Оборудование.Состояние = Перечисления.СостоянияОборудования.Рабочее;	
		КонецЕсли;
		
		Если Строка(Оборудование.Местоположение) = "" Тогда
			Оборудование.Местоположение = Объект.Заведение;	
		КонецЕсли;
		

	КонецЦикла;;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	СписокПриИзмененииНаСервере();
КонецПроцедуры
